app/controllers/home_controller.rb

SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Logotipo"], ["LIMIT", 1]]
---
  def index
    @recurso = Recurso.find_by(title: "Logotipo")
    @url_logo = url_for(@recurso.imagen)
    @recurso = Recurso.find_by(title: "Hamburguesas")
    @url_burger = url_for(@recurso.imagen)
    @recurso = Recurso.find_by(title: "Pizzeria")

SELECT "productos".* FROM "productos"
SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Registro"], ["LIMIT", 1]]
---
  def list_products
    @productos = Producto.all
    @recurso = Recurso.find_by(title: "Logotipo")

SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Logotipo"], ["LIMIT", 1]]
SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Login"], ["LIMIT", 1]]
---
  def registro
    @cliente = Cliente.new
    @recurso = Recurso.find_by(title: "Registro")
    @url_new = url_for(@recurso.imagen)
    @recurso = Recurso.find_by(title: "Logotipo")

INSERT INTO "clientes" ("nombre", "correo", "contraseña", "direccion", "telefono", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create_registro
    @cliente = Cliente.new(cliente_params)

    if @cliente.save

SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Logotipo"], ["LIMIT", 1]]
SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Pre_registro"], ["LIMIT", 1]]
---
  def pre_login
    @recurso = Recurso.find_by(title: "Pre_registro")
    @url_prelogin = url_for(@recurso.imagen)
    @recurso = Recurso.find_by(title: "Logotipo")