app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @producto = Producto.find(params[:id])

INSERT INTO "productos" ("nombre", "precio", "descripcion", "promocion", "tipo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    # Crea un nuevo objeto Producto con los parámetros recibidos del formulario
    @producto = Producto.new(producto_params)

    # Verifica si se ha adjuntado una imagen en los parámetros recibidos
    if params[:producto][:foto].present?
      # Sube la imagen a Cloudinary
      result = Cloudinary::Uploader.upload(params[:producto][:foto])

      # Si la carga de la imagen a Cloudinary fue exitosa, asigna la URL de la imagen al atributo foto del Producto
      if result.present? && result['secure_url'].present?
        @producto.foto = result['secure_url']
      else
        # Maneja el caso en el que la carga de la imagen a Cloudinary falló
        flash[:error] = 'Hubo un error al subir la imagen a Cloudinary.'
        render :new, status: :unprocessable_entity
        return
      end
    end

    # Intenta guardar el producto en la base de datos
    if @producto.save

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @producto = Producto.find(params[:id])

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "productos" SET "updated_at" = $1, "img" = $2 WHERE "productos"."id" = $3  [["updated_at", "2024-04-12 02:01:51.626456"], ["img", "#<ActionDispatch::Http::UploadedFile:0x00000193949cbdb8>"], ["id", 2]]
---
  def update
    @producto = Producto.find(params[:id])

    if @producto.update(producto_params)

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 1]]
---
  def destroy
    @producto = Producto.find(params[:id])
    @producto.destroy