app/controllers/recursos_controller.rb

SELECT "recursos".* FROM "recursos"
---
    def index
        @recursos = Recurso.all

SELECT "recursos".* FROM "recursos" WHERE "recursos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      def show
        @recurso = Recurso.find(params[:id])

INSERT INTO "recursos" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", nil], ["created_at", "2024-04-14 01:28:49.206162"], ["updated_at", "2024-04-14 01:28:49.206162"]]
---
      def create
        @recurso = Recurso.new(recurso_params)

        if @recurso.save

SELECT "recursos".* FROM "recursos" WHERE "recursos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
      def edit
        @recurso = Recurso.find(params[:id])

SELECT "recursos".* FROM "recursos" WHERE "recursos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "recursos" SET "updated_at" = $1 WHERE "recursos"."id" = $2  [["updated_at", "2024-04-14 02:30:57.685977"], ["id", 6]]
---
      def update
        @recurso = Recurso.find(params[:id])

        if @recurso.update(recurso_params)

SELECT "recursos".* FROM "recursos" WHERE "recursos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "recursos" WHERE "recursos"."id" = $1  [["id", 4]]
---
      def destroy
        @recurso = Recurso.find(params[:id])
        @recurso.destroy