app/controllers/sessions_controller.rb

    def new
        @recurso = Recurso.find_by(title: "Login")
        @url_login = url_for(@recurso.imagen)
        @recurso = Recurso.find_by(title: "Logotipo")
---
SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Login"], ["LIMIT", 1]]
SELECT "recursos".* FROM "recursos" WHERE "recursos"."title" = $1 LIMIT $2  [["title", "Logotipo"], ["LIMIT", 1]]

    def create
      @Cliente = Cliente.find_by("telefono = :telefono", { telefono: params[:telefono] })
---
SELECT "clientes".* FROM "clientes" WHERE (telefono = '6181745549') LIMIT $1  [["LIMIT", 1]]