app/controllers/ubicacions_controller.rb

    def index
        @ubicaciones = Ubicacion.all
---
SELECT "ubicacions".* FROM "ubicacions"

    def create
        @cliente = Cliente.find(params[:cliente_id])
        @ubicacion = @cliente.ubicacions.create(ubicacion_params)

        if @ubicacion.save
---
INSERT INTO "ubicacions" ("calle", "numero", "cp", "descripcion", "cliente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["calle", ""], ["numero", ""], ["cp", ""], ["descripcion", ""], ["cliente_id", nil], ["created_at", "2024-04-15 06:14:10.998314"], ["updated_at", "2024-04-15 06:14:10.998314"]]